БукмекерскаяКонтора/src/Catalogs/Исходы/Исходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Исходы</name>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

БукмекерскаяКонтора/src/Documents/Ставка/Ставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Ставка</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исход</name>
    <type>
      <types>CatalogRef.Исходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусСтавки</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БукмекерскаяКонтора/src/Catalogs/Исходы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Мероприятие.Завершено
	Тогда
		Отказ = Истина;
		Сообщить("Нельзя добавить или изменить исход завершенного мероприятия")
	Иначе
		Если ТекущийОбъект.Дата < ТекущийОбъект.Мероприятие.ДатаНачала 
		Тогда
			Отказ = Истина;
			Сообщить("ДатаНачала исхода не может быть раньше даты начала мероприятия");
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделатьСтавку(Команда)
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Мероприятие",
	 ЭтаФорма.Объект.Мероприятие);
	 ПараметрыЗаполнения.Вставить("Исход",
	 ЭтаФорма.Объект.Ссылка);
 
 	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
 	
	ОткрытьФорму("Документ.Ставка.Форма.Создать", ПараметрыФормы);	
КонецПроцедуры


&НаКлиенте
Процедура МероприятиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение)
	ЭтотОбъект.Объект.ДатаНачала = ВыбранноеЗначение.ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура МероприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МероприятиеНачалоВыбораНаСервере(ДанныеВыбора);
КонецПроцедуры

&НаСервере
Процедура МероприятиеНачалоВыбораНаСервере(ДанныеВыбора)
	ДанныеВыбора = Новый СписокЗначений();
	
	Запрос = новый Запрос();
	Запрос.Текст = "Выбрать
	|Мероприятие.Ссылка,
	|Мероприятие.Наименование
	|Из
	|Справочник.Мероприятия как Мероприятие
	|Где
	|Мероприятие.Завершено = Ложь";
	Мероприятие = Запрос.Выполнить().Выбрать();
	
	Пока Мероприятие.Следующий() Цикл
		ДанныеВыбора.Добавить(Мероприятие.Ссылка, Мероприятие.Наименование);
	КонецЦикла;
КонецПроцедуры
